ХамелионЦРПТ/src/Catalogs/ОписаниеРегламентныхЗаданий_ХамелеонЦРПТ/ОписаниеРегламентныхЗаданий_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОписаниеРегламентныхЗаданий_ХамелеонЦРПТ</name>
  <predefined>
    <items>
      <name>МВ_АвтоматическаяОтправкаЦРПТ</name>
      <description>(МВ) Автоматическая отправка ЦРПТ</description>
    </items>
    <items>
      <name>СоздатьАгрегацииИОтправитьВЦРПТ</name>
      <description>Загрузить XML файлы с агрегациями из каталога и отправить в ЦРПТ</description>
    </items>
    <items>
      <name>ЗагрузкаВсехПриходовДиадок</name>
      <description>Загрузка всех приходов Диадок</description>
    </items>
    <items>
      <name>ЗагрузкаВсехПриходов</name>
      <description>Загрузка всех приходов по всем пользователям</description>
    </items>
    <items>
      <name>ЗагрузкаВсехПриходовСБИС</name>
      <description>Загрузка всех приходов СБИС</description>
    </items>
    <items>
      <name>ЗагрузкаВсехПриходовТакском</name>
      <description>Загрузка всех приходов Такском</description>
    </items>
    <items>
      <name>ЗагрузкаВсехПриходовЭДОЛайт</name>
      <description>Загрузка всех приходов ЭДОЛайт</description>
    </items>
    <items>
      <name>ЗагрузкаПриемки</name>
      <description>Загрузка приемки по текущему пользователю</description>
    </items>
    <items>
      <name>ЗагрузкаЧековККМизЦРПТзаВЧЕРА</name>
      <description>Загрузка чеков ККМ из ЦРПТ за ВЧЕРА</description>
    </items>
    <items>
      <name>ОбновитьСтатусыПоВемОрганизациямАгрегации</name>
      <description>Обновить статусы по всем организациям агрегации</description>
    </items>
    <items>
      <name>ОбновитьСтатусыПоВсемОрганизациямАгрегацииНаСервере</name>
      <description>Обновить статусы по всем организациям агрегации на сервере</description>
    </items>
    <items>
      <name>ОбновитьСтатусыПоВемОрганизациямВводВОборот</name>
      <description>Обновить статусы по всем организациям ввод в оборот</description>
    </items>
    <items>
      <name>ОбновитьСтатусыПоВсемОрганизациямВводВОборотНаСервере</name>
      <description>Обновить статусы по всем организациям ввод в оборот на сервере</description>
    </items>
    <items>
      <name>ОбновитьСтатусыПоВемОрганизациямПриемка</name>
      <description>Обновить статусы по всем организациям приемка</description>
    </items>
    <items>
      <name>ОбновитьСтатусыПоВсемОрганизациямПриемкаНаСервере</name>
      <description>Обновить статусы по всем организациям приемка на сервере</description>
    </items>
    <items>
      <name>Вспомогательная</name>
      <description>Обновление статусов</description>
    </items>
    <items>
      <name>ОбновлениеСтатусовПоВсем</name>
      <description>Обновление статусов по всем</description>
    </items>
    <items>
      <name>ОтправитьАгрегацииИОбновитьСтатусы</name>
      <description>Отправить агрегации и обновить статусы за 3 дня на сервере</description>
    </items>
    <items>
      <name>ОтправитьВводВОборотВЦРПТ</name>
      <description>Отправить подготовленные вводы в оборот в ЦРПТ за текущий день</description>
    </items>
    <items>
      <name>ПринятьПриходыПоВсемОрганизациям</name>
      <description>Подтверждать приходы по всем организациям автоматически</description>
    </items>
  </predefined>
  <attributes>
    <name>Алгоритм</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнитьНаКлиенте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ХамелионЦРПТ/src/Catalogs/ОписаниеРегламентныхЗаданий_ХамелеонЦРПТ/ManagerModule.bsl
Процедура ОбновлениеСтатусов() Экспорт
	СпрОб1=Справочники.ОписаниеРегламентныхЗаданий_ХамелеонЦРПТ.Вспомогательная.ПолучитьОбъект();
	Макет1=Справочники.ОписаниеРегламентныхЗаданий_ХамелеонЦРПТ.ПолучитьМакет("ОбновлениеСтатусов");
	СпрОб1.Алгоритм=Макет1.ПолучитьТекст();
	СпрОб1.ВыполнитьНаКлиенте=Истина;
	СпрОб1.Записать();
	
КонецПроцедуры


Процедура ОбновлениеЗагрузкиЧековЗаВчера() Экспорт
	СпрОб1=Справочники.ОписаниеРегламентныхЗаданий_ХамелеонЦРПТ.ЗагрузкаЧековККМизЦРПТзаВЧЕРА.ПолучитьОбъект();
	Макет1=Справочники.ОписаниеРегламентныхЗаданий_ХамелеонЦРПТ.ПолучитьМакет("ЗагрузкаЧековККМизЦРПТзаВЧЕРА");
	СпрОб1.Алгоритм=Макет1.ПолучитьТекст();
	СпрОб1.ВыполнитьНаКлиенте=Истина;
	СпрОб1.Записать();
	
КонецПроцедуры

Процедура ОбновлениеПриемки() Экспорт
	СпрОб1=Справочники.ОписаниеРегламентныхЗаданий_ХамелеонЦРПТ.ЗагрузкаПриемки.ПолучитьОбъект();
	Макет1=Справочники.ОписаниеРегламентныхЗаданий_ХамелеонЦРПТ.ПолучитьМакет("ЗагрузкаПриемки");
	СпрОб1.Алгоритм=Макет1.ПолучитьТекст();
	СпрОб1.ВыполнитьНаКлиенте=Истина;
	СпрОб1.Записать();
	
КонецПроцедуры

Процедура ОбновитьПредопределенныеРегламент() Экспорт
	ОбновлениеСтатусов();
	ОбновлениеПриемки();
	
КонецПроцедуры

Процедура ОбновлениеСтатусовВсехПользователей() Экспорт
	СпрОб1=Справочники.ОписаниеРегламентныхЗаданий_ХамелеонЦРПТ.ОбновлениеСтатусовПоВсем.ПолучитьОбъект();
	Макет1=Справочники.ОписаниеРегламентныхЗаданий_ХамелеонЦРПТ.ПолучитьМакет("ОбновлениеСтатусовПоВсем");
	СпрОб1.Алгоритм=Макет1.ПолучитьТекст();
	СпрОб1.ВыполнитьНаКлиенте=Истина;
	СпрОб1.Записать();
	
	СпрОб1=Справочники.ОписаниеРегламентныхЗаданий_ХамелеонЦРПТ.ЗагрузкаВсехПриходов.ПолучитьОбъект();
	Макет1=Справочники.ОписаниеРегламентныхЗаданий_ХамелеонЦРПТ.ПолучитьМакет("ЗагрузкаВсехПриходов");
	СпрОб1.Алгоритм=Макет1.ПолучитьТекст();
	СпрОб1.ВыполнитьНаКлиенте=Истина;
	СпрОб1.Записать();
	
	
	СпрОб1=Справочники.ОписаниеРегламентныхЗаданий_ХамелеонЦРПТ.ОбновитьСтатусыПоВемОрганизациямАгрегации.ПолучитьОбъект();
	Макет1=Справочники.ОписаниеРегламентныхЗаданий_ХамелеонЦРПТ.ПолучитьМакет("ОбновитьСтатусыПоВемОрганизациямАгрегации");
	СпрОб1.Алгоритм=Макет1.ПолучитьТекст();
	СпрОб1.ВыполнитьНаКлиенте=Истина;
	СпрОб1.Записать();
	
	СпрОб1=Справочники.ОписаниеРегламентныхЗаданий_ХамелеонЦРПТ.ОбновитьСтатусыПоВемОрганизациямВводВОборот.ПолучитьОбъект();
	Макет1=Справочники.ОписаниеРегламентныхЗаданий_ХамелеонЦРПТ.ПолучитьМакет("ОбновитьСтатусыПоВемОрганизациямВводВОборот");
	СпрОб1.Алгоритм=Макет1.ПолучитьТекст();
	СпрОб1.ВыполнитьНаКлиенте=Истина;
	СпрОб1.Записать();
	
	СпрОб1=Справочники.ОписаниеРегламентныхЗаданий_ХамелеонЦРПТ.ОбновитьСтатусыПоВемОрганизациямПриемка.ПолучитьОбъект();
	Макет1=Справочники.ОписаниеРегламентныхЗаданий_ХамелеонЦРПТ.ПолучитьМакет("ОбновитьСтатусыПоВемОрганизациямПриемка");
	СпрОб1.Алгоритм=Макет1.ПолучитьТекст();
	СпрОб1.ВыполнитьНаКлиенте=Истина;
	СпрОб1.Записать();
	
	
	СпрОб1=Справочники.ОписаниеРегламентныхЗаданий_ХамелеонЦРПТ.ЗагрузкаВсехПриходовДиадок.ПолучитьОбъект();
	Макет1=Справочники.ОписаниеРегламентныхЗаданий_ХамелеонЦРПТ.ПолучитьМакет("ЗагрузкаВсехПриходовДиадок");
	СпрОб1.Алгоритм=Макет1.ПолучитьТекст();
	СпрОб1.ВыполнитьНаКлиенте=Истина;
	СпрОб1.Записать();
	
	
	СпрОб1=Справочники.ОписаниеРегламентныхЗаданий_ХамелеонЦРПТ.ЗагрузкаВсехПриходовСБИС.ПолучитьОбъект();
	Макет1=Справочники.ОписаниеРегламентныхЗаданий_ХамелеонЦРПТ.ПолучитьМакет("ЗагрузкаВсехПриходовСБИС");
	СпрОб1.Алгоритм=Макет1.ПолучитьТекст();
	СпрОб1.ВыполнитьНаКлиенте=Истина;
	СпрОб1.Записать();
	
	
	СпрОб1=Справочники.ОписаниеРегламентныхЗаданий_ХамелеонЦРПТ.ЗагрузкаВсехПриходовТакском.ПолучитьОбъект();
	Макет1=Справочники.ОписаниеРегламентныхЗаданий_ХамелеонЦРПТ.ПолучитьМакет("ЗагрузкаВсехПриходовТакском");
	СпрОб1.Алгоритм=Макет1.ПолучитьТекст();
	СпрОб1.ВыполнитьНаКлиенте=Истина;
	СпрОб1.Записать();
	
	
	СпрОб1=Справочники.ОписаниеРегламентныхЗаданий_ХамелеонЦРПТ.ЗагрузкаВсехПриходовЭДОЛайт.ПолучитьОбъект();
	Макет1=Справочники.ОписаниеРегламентныхЗаданий_ХамелеонЦРПТ.ПолучитьМакет("ЗагрузкаВсехПриходовЭДОЛайт");
	СпрОб1.Алгоритм=Макет1.ПолучитьТекст();
	СпрОб1.ВыполнитьНаКлиенте=Истина;
	СпрОб1.Записать();
		
КонецПроцедуры


Процедура ПринятьВсеПриходы() Экспорт
	СпрОб1=Справочники.ОписаниеРегламентныхЗаданий_ХамелеонЦРПТ.ПринятьПриходыПоВсемОрганизациям.ПолучитьОбъект();
	Макет1=Справочники.ОписаниеРегламентныхЗаданий_ХамелеонЦРПТ.ПолучитьМакет("ПринятьПриходыПоВсемОрганизациям");
	СпрОб1.Алгоритм=Макет1.ПолучитьТекст();
	СпрОб1.ВыполнитьНаКлиенте=Истина;
	СпрОб1.Записать();
	
КонецПроцедуры


Процедура ОбновитьСтатусыВсехПоСервере() Экспорт
	СпрОб1=Справочники.ОписаниеРегламентныхЗаданий_ХамелеонЦРПТ.ОбновитьСтатусыПоВсемОрганизациямАгрегацииНаСервере.ПолучитьОбъект();
	Макет1=Справочники.ОписаниеРегламентныхЗаданий_ХамелеонЦРПТ.ПолучитьМакет("ОбновитьСтатусыПоВсемОрганизациямАгрегацииНаСервере");
	СпрОб1.Алгоритм=Макет1.ПолучитьТекст();
	СпрОб1.ВыполнитьНаКлиенте=Ложь;
	СпрОб1.Записать();
	
	СпрОб1=Справочники.ОписаниеРегламентныхЗаданий_ХамелеонЦРПТ.ОбновитьСтатусыПоВсемОрганизациямВводВОборотНаСервере.ПолучитьОбъект();
	Макет1=Справочники.ОписаниеРегламентныхЗаданий_ХамелеонЦРПТ.ПолучитьМакет("ОбновитьСтатусыПоВсемОрганизациямВводВОборотНаСервере");
	СпрОб1.Алгоритм=Макет1.ПолучитьТекст();
	СпрОб1.ВыполнитьНаКлиенте=Ложь;
	СпрОб1.Записать();
	
	СпрОб1=Справочники.ОписаниеРегламентныхЗаданий_ХамелеонЦРПТ.ОбновитьСтатусыПоВсемОрганизациямПриемкаНаСервере.ПолучитьОбъект();
	Макет1=Справочники.ОписаниеРегламентныхЗаданий_ХамелеонЦРПТ.ПолучитьМакет("ОбновитьСтатусыПоВсемОрганизациямПриемкаНаСервере");
	СпрОб1.Алгоритм=Макет1.ПолучитьТекст();
	СпрОб1.ВыполнитьНаКлиенте=Ложь;
	СпрОб1.Записать();
	
	
КонецПроцедуры

Процедура СоздатьАгрегацииИОтправитьВЦРПТ() Экспорт
	СпрОб1=Справочники.ОписаниеРегламентныхЗаданий_ХамелеонЦРПТ.СоздатьАгрегацииИОтправитьВЦРПТ.ПолучитьОбъект();
	Макет1=Справочники.ОписаниеРегламентныхЗаданий_ХамелеонЦРПТ.ПолучитьМакет("СоздатьАгрегацииИОтправитьВЦРПТ");
	СпрОб1.Алгоритм=Макет1.ПолучитьТекст();
	СпрОб1.ВыполнитьНаКлиенте=Ложь;
	СпрОб1.Записать();
	
КонецПроцедуры

Процедура ОтправитьАгрегацииИОбновитьСтатусы() Экспорт
	СпрОб1=Справочники.ОписаниеРегламентныхЗаданий_ХамелеонЦРПТ.ОтправитьАгрегацииИОбновитьСтатусы.ПолучитьОбъект();
	Макет1=Справочники.ОписаниеРегламентныхЗаданий_ХамелеонЦРПТ.ПолучитьМакет("ОтправитьАгрегацииИОбновитьСтатусы");
	СпрОб1.Алгоритм=Макет1.ПолучитьТекст();
	СпрОб1.ВыполнитьНаКлиенте=Ложь;
	СпрОб1.Записать();
	
КонецПроцедуры

//++ МВ:Овчинников 30.09.2020 •1
Процедура МВ_АвтоматическаяОтправкаЦРПТ() Экспорт
	
	СпрОб1=Справочники.ОписаниеРегламентныхЗаданий_ХамелеонЦРПТ.МВ_АвтоматическаяОтправкаЦРПТ.ПолучитьОбъект();
	Макет1=Справочники.ОписаниеРегламентныхЗаданий_ХамелеонЦРПТ.ПолучитьМакет("МВ_АвтоматическаяОтправкаЦРПТ");
	СпрОб1.Алгоритм=Макет1.ПолучитьТекст();
	СпрОб1.ВыполнитьНаКлиенте=Истина;
	СпрОб1.Записать();
	
КонецПроцедуры //-- МВ:Овчинников  28.09.2020
